#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-D8qYzjbmt2cmt6Yw

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.hackathon_bucket.random_id.this: Refreshing state... [id=kJkL]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.logging_bucket.random_id.this: Refreshing state... [id=SssY]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.hackathon_bucket.aws_s3_bucket.this: Refreshing state... [id=hackathon-90990b]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
aws_route53_zone.forkup: Refreshing state... [id=Z06686303IG6BF3DZ1HIL]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_sqs_queue.expense_analysis_completions: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/558855412466/expense-analysis-completions]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_sns_topic.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions]
data.aws_caller_identity.current: Refreshing...
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
data.aws_caller_identity.current: Refresh complete after 0s [id=558855412466]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
module.logging_bucket.aws_s3_bucket.this: Refreshing state... [id=logging-4acb18]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_sns_topic_subscription.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions:99889508-405a-4819-ad5e-d178d1865649]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20250515130958670600000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
module.hackathon_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=hackathon-90990b]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.secondary.data.aws_subnet.self: Refreshing...
module.database.data.aws_subnet.self: Refreshing...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-09f6eeec0221dfd5a]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.secondary.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.database.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1144224394]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-454363948]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1542917916]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-3328683172]
module.secondary.aws_instance.this: Refreshing state... [id=i-0a5cc9ee813117d00]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-594973929]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1031826490]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3522225157]
module.logging_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=logging-4acb18]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
aws_security_group_rule.allow_inbound_connections_from_secondary: Refreshing state... [id=sgrule-434827353]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-0e40b29e840f98ce4]
aws_route53_record.records["forkup"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_forkup_A]
aws_route53_record.records["today"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_today_A]
aws_route53_record.records["uptime"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_uptime_A]
aws_route53_record.forkup_records[""]: Refreshing state... [id=Z06686303IG6BF3DZ1HIL__A]
aws_route53_record.records[""]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.records["tags"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
aws_sqs_queue.expense_analysis_completions: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.forkup_dev_policy will be created
  + resource "aws_iam_policy" "forkup_dev_policy" {
      + arn         = (known after apply)
      + description = "Permissions for the forkup-dev role"
      + id          = (known after apply)
      + name        = "forkup-dev-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::hackathon-90990b"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::hackathon-90990b/*"
                    },
                  + {
                      + Action   = [
                          + "textract:AnalyzeExpense",
                          + "textract:StartExpenseAnalysis",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions"
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:PassedToService" = "textract.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.forkup_dev will be created
  + resource "aws_iam_role" "forkup_dev" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::558855412466:user/alex.jackson"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forkup-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.forkup_dev will be created
  + resource "aws_iam_role_policy_attachment" "forkup_dev" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "forkup-dev"
    }

  # module.personal.aws_iam_user_policy.this will be updated in-place
  ~ resource "aws_iam_user_policy" "this" {
        id          = "alex.jackson:alex.jackson.policy"
        name        = "alex.jackson.policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "textract:AnalyzeExpense",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sts:AssumeRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::558855412466:role/forkup-dev"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>